# **Tarea Nº 4**

- Fecha y hora de entrega: Domingo 12 de enero, 11:59pm
- Agregue los nombres de las personas con las que discutió esta tarea: ____ Armando Paredes ______
- Envíe su tarea haciendo el `push` de su código a su repo en GitHub Classroom:

## **Mercado de autos usados**

Importa el conjunto de datos `neoauto_20240924.csv`

In [2]:
import pandas as pd

In [94]:
base_prop = pd.read_csv("neoauto_20240924.csv", delimiter=",")

In [95]:
base_prop

,value,item_id,item_price,item_name,item_category,item_category_2,item_brand,item_km,item_year,item_transmission,...,item_location_province,item_tag,item_advertiser,item_credit,item_verified,item_financed_by,santander_price,item_publication_slug,item_publication_type,item_publication_type_Id
0,29200,1807331,29200.0,toyota hilux 2021,autos,Pick Up,TOYOTA,51635.0,2021,Mecánica,...,lima,Como nuevo,Erick Bazán Ubaldo,True,True,Santander,NaN,auto/usado/toyota-hilux-2021-1807331,PREMIUM,25
1,98500,1807393,98500.0,lexus lx 600 2023,autos,Camionetas Suv,LEXUS,15000.0,2023,Automática - Secuencial,...,lima,Como nuevo,Asesor Gabriel NovoCar,False,True,NaN,NaN,auto/usado/lexus-lx-600-2023-1807393,PREMIUM,25
2,16800,1739308,17800.0,bmw 520-i 2016,autos,Sedan,BMW,66000.0,2016,Automática - Secuencial,...,lima,Ocasión,Carlos Chauca,True,True,Santander,16800.0,auto/usado/bmw-520-i-2016-1739308,PREMIUM,25
3,15900,1805714,16900.0,chevrolet captiva 2021,autos,Camionetas Suv,CHEVROLET,40300.0,2021,Automática - Secuencial,...,santa,Premium,Darwin Américo Barrón Pastor,True,True,Santander,15900.0,auto/usado/chevrolet-captiva-2021-1805714,PREMIUM,25
4,12500,1806332,12500.0,dfsk glory 500 2023,autos,Camionetas Suv,DFSK,33000.0,2023,Mecánica,...,lima,Premium,GORDILLO FERNANDO,True,True,Santander,NaN,auto/usado/dfsk-glory-500-2023-1806332,PREMIUM,25
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4036,18000,1805535,18000.0,mini 5 puertas 2018,autos,Hatchback,MINI,32500.0,2018,Automática,...,lima,NaN,elizabeth arias,True,False,Santander,NaN,auto/usado/mini-5-puertas-2018-1805535,GRATUITO,27
4037,15000,1805482,16000.0,bmw 120i 2016,autos,Deportivo,BMW,83000.0,2016,Automática - Secuencial,...,lima,NaN,Fabrizio Canales,True,False,Santander,15000.0,auto/usado/bmw-120i-2016-1805482,GRATUITO,27
4038,9000,1805528,10000.0,volkswagen gol 2022,autos,Sedan,VOLKSWAGEN,43000.0,2022,Mecánica,...,lima,NaN,Mario Toledo Castillo,True,False,Santander,9000.0,auto/usado/volkswagen-gol-2022-1805528,GRATUITO,27
4039,30500,1805518,31500.0,bmw x5 2016,autos,Camionetas Suv,BMW,32000.0,2016,Automática - Secuencial,...,lima,NaN,SHH Hearne,True,False,Santander,30500.0,auto/usado/bmw-x5-2016-1805518,GRATUITO,27
4040,5500,1805432,5500.0,suzuki swift 2008,autos,Hatchback,SUZUKI,1600.0,2008,Automática,...,lima,NaN,Susana Patiño,False,False,NaN,NaN,auto/usado/suzuki-swift-2008-1805432,GRATUITO,27

1. ¿Cuál es el precio promedio de los autos de cada marca (`item_brand`) publicados en cada subcategoría (`item_category_2`)?

In [98]:
base_prop.groupby( ['item_category_2','item_brand'], as_index = False ).agg( { "item_price": "mean" } )

    item_category_2     item_brand     item_price
0    Camionetas Suv   ASTON MARTIN  229000.000000
1    Camionetas Suv           AUDI   34602.424242
2    Camionetas Suv           BAIC   10800.000000
3    Camionetas Suv  BAIC YINXIANG    8500.000000
4    Camionetas Suv            BMW   38377.802469
..              ...            ...            ...
197            Vans            RAM    8883.333333
198            Vans        RENAULT    4900.000000
199            Vans         SUZUKI   11058.333333
200            Vans         TOYOTA   16080.000000
201            Vans     VOLKSWAGEN   14350.000000

[202 rows x 3 columns]

2. ¿Cuántos autos tienen más de 100,000 kilómetros (`item_km`) pero un precio (`item_price`) menor al promedio general?

In [99]:
mean_price=base_prop['item_price'].mean()
filtered_data =base_prop.loc[(base_prop['item_km'] > 100000) & (base_prop['item_price'] < mean_price), ['item_km', 'item_price']]
n_autos = filtered_data.shape[0]

print(f"Hay {n_autos} autos con más de 100,000 km, pero con precio inferior al promedio general.")

Hay 497 autos con más de 100,000 km, pero con precio inferior al promedio general.

3. Encuentra el modelo (`item_name`) más caro y el más barato de cada marca (`item_brand`).

In [103]:
# Solución

# Hallamos el item más barato y mas caro por marca
precios = base_prop.groupby("item_brand")["item_price"].agg([min, max]).reset_index()
precios1 = precios.rename(columns={"item_brand": "Marca"})
print("Por marca, los modelos más caros y más baratos son:")
#print(precios1)

# Identificamos de qué modelo son los vehículos identificados
for index, row in precios1.iterrows():
    marca = row["Marca"]
    precio_bajo = row["min"]
    precio_alto = row["max"]

    modelo_min = base_prop[(base_prop["item_brand"] == marca) & (base_prop["item_price"] == precio_bajo)]["item_name"].iloc[0]
    modelo_max = base_prop[(base_prop["item_brand"] == marca) & (base_prop["item_price"] == precio_alto)]["item_name"].iloc[0]

    precios1.loc[index, "Modelo más barato"] = modelo_min
    precios1.loc[index, "Modelo más caro"] = modelo_max

display(precios1)

Por marca, los modelos más caros y más baratos son:

,Marca,min,max,Modelo más barato,Modelo más caro
0,ALFA-ROMEO,2500.0,8500.0,alfa-romeo alfasud 1982,alfa-romeo 147 2006
1,ASTON MARTIN,149900.0,229000.0,aston martin db11 2017,aston martin dbx 2021
2,AUDI,0.0,220000.0,audi a3 sedan 2015,audi rs 6 2024
3,AUSTIN,1.0,1.0,austin mini cooper 1970,austin mini cooper 1970
4,BAIC,7500.0,12800.0,baic plus 2018,baic x55 2021
...,...,...,...,...,...
68,SWM,14000.0,14000.0,swm g05 pro 2022,swm g05 pro 2022
69,TOYOTA,0.0,100000.0,toyota land cruiser prado 2011,toyota hilux 2019
70,TRIUMPH,18900.0,18900.0,triumph tr-7 1971,triumph tr-7 1971
71,VOLKSWAGEN,0.0,48900.0,volkswagen bora 2015,volkswagen teramont 2023
72,VOLVO,2100.0,84990.0,volvo 850 turbo 1995,volvo xc-90 2023

4. Encuentra las tres marcas con mayor número de autos financiados por Santander (`item_financed_by`).

In [104]:
# Solución
financiados=base_prop.loc[base_prop.item_financed_by=='Santander']
financiados_por_marca=financiados.groupby('item_brand', as_index=False).size()
(financiados_por_marca.sort_values(by='size', ascending=False)).head(3)

   item_brand  size
3         BMW   296
54     TOYOTA   261
43     NISSAN   228

5. Agrupa las publicaciones por tipo de transmisión (`item_transmission`) y calcula la desviación estándar del precio (`item_price`) para cada tipo.

In [105]:
# Solución
base_prop.groupby( 'item_transmission', as_index = False ).agg( { "item_price": "std" } )

         item_transmission    item_price
0               Automática  15332.729048
1  Automática - Secuencial  22678.641589
2                 Mecánica   8137.122127

6. ¿Cuál es el kilometraje promedio de las publicaciones con el tag "Premium" y de las publicaciones con el tag "Como nuevo"?

In [106]:
# Solución
df_premium = base_prop.loc[base_prop.item_tag == "Premium", :]
df_como_nuevo = base_prop.loc[base_prop.item_tag == "Como nuevo", :]

df_premium_prom = df_premium["item_km"].mean()
df_como_nuevo_prom = df_como_nuevo["item_km"].mean()

print(f"Los autos con el tag Premium tienen un kilometraje promedio de {df_premium_prom:.2f} km., mientras que los de tag Como Nuevo tienen un kilometraje promedio de {df_como_nuevo_prom:.2f} km.")

Los autos con el tag Premium tienen un kilometraje promedio de 48400.24 km., mientras que los de tag Como Nuevo tienen un kilometraje promedio de 35963.48 km.

7. ¿Cuáles son las marcas de vehículas para los que todos sus modelos fabricados en los últimos 5 años tienen al menos 5 publicaciones cada una?

In [107]:
# Solución
# Solución

#filtramos los ultimos 5 años (no consideramos 2025)

last_years = base_prop[(2024 >= base_prop["item_year"]) & (base_prop["item_year"]>=2019)]

#contamos cuantas veces aparece cada modelo (por marca)

grupo_1 = (last_years.groupby(["item_brand", "item_name"]).size().reset_index(name="conteo"))

#y ahora añadimos la condición de al menos 5 publicaciones por modelo

grupo_2 = grupo_1[grupo_1["conteo"] >= 5]

#contamos el numero de modelos que cumplen las condiciones, por marca
grupo_3 = (
    grupo_2.groupby("item_brand")["item_name"]
    .nunique()
    .reset_index(name="modelos que cumplen")
)

#y ahora contamos el numero de modelos totales producidos en el periodo dado

grupo_4 = (last_years.groupby("item_brand")["item_name"].nunique().reset_index(name="modelos totales"))

#unimos los ultimos 2 grupos para identificar qué marcas cumplen la condición

resultado = pd.merge(grupo_3, grupo_4, on = "item_brand")
print(resultado)
print()
print("Entonces, no hay una sola marca que cumpla con las condiciones solicitadas")

       item_brand  modelos que cumplen  modelos totales
0            AUDI                    1               28
1             BMW                    8               78
2       CHEVROLET                    1               41
3            DFSK                    2               12
4            FIAT                    1                3
5            FORD                    7               39
6           HAVAL                    1               12
7           HONDA                    2               23
8         HYUNDAI                    4               46
9            JEEP                    2               28
10            KIA                    5               39
11          MAZDA                    6               39
12  MERCEDES BENZ                    2               62
13             MG                    1               15
14         NISSAN                    8               45
15        PEUGEOT                    1               15
16        RENAULT                    2               14
17         SUBARU                    4               28
18         TOYOTA                   12               58
19     VOLKSWAGEN                    6               42
20          VOLVO                    2               13

Entonces, no hay una sola marca que cumpla con las condiciones solicitadas

## **Evolución económica internacional**

Importa el conjunto de datos de la hoja "Data" del archivo `pwt1001.xlsx`. El diccionario de variables está disponible en la hoja "Legend" del archivo Excel.

In [3]:
datos_2 = pd.read_excel("pwt1001.xlsx", sheet_name="Data")
datos_2

,countrycode,country,currency_unit,year,rgdpe,rgdpo,pop,emp,avh,hc,...,csh_x,csh_m,csh_r,pl_c,pl_i,pl_g,pl_x,pl_m,pl_n,pl_k
0,ABW,Aruba,Aruban Guilder,1950,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ABW,Aruba,Aruban Guilder,1951,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ABW,Aruba,Aruban Guilder,1952,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ABW,Aruba,Aruban Guilder,1953,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,ABW,Aruba,Aruban Guilder,1954,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12805,ZWE,Zimbabwe,US Dollar,2015,40141.617188,39798.644531,13.814629,6.393752,NaN,2.584653,...,0.140172,-0.287693,-0.051930,0.479228,0.651287,0.541446,0.616689,0.533235,0.425715,1.778124
12806,ZWE,Zimbabwe,US Dollar,2016,41875.203125,40963.191406,14.030331,6.504374,NaN,2.616257,...,0.131920,-0.251232,-0.016258,0.470640,0.651027,0.539631,0.619789,0.519718,0.419446,1.728804
12807,ZWE,Zimbabwe,US Dollar,2017,44672.175781,44316.742188,14.236595,6.611773,NaN,2.648248,...,0.126722,-0.202827,-0.039897,0.473560,0.639560,0.519956,0.619739,0.552042,0.418681,1.756007
12808,ZWE,Zimbabwe,US Dollar,2018,44325.109375,43420.898438,14.438802,6.714952,NaN,2.680630,...,0.144485,-0.263658,-0.020791,0.543757,0.655473,0.529867,0.641361,0.561526,0.426527,1.830088
12809,ZWE,Zimbabwe,US Dollar,2019,42296.062500,40826.570312,14.645468,6.831017,NaN,2.713408,...,0.213562,-0.270959,-0.089798,0.494755,0.652439,0.500927,0.487763,0.430082,0.419883,1.580885

1. Calcule el PBI per cápita real ajustado por poder de paridad de compra (PPP). Use la variable de PBI que se calcula por gasto y la población. ¿Cuáles son los 10 países top?

In [4]:
# Solución

# Se solicita rgdpe/pop para cada pais (asumimos un promedio de 2010 a 2019)
pais_ultimos_10 = datos_2[datos_2["year"] >= 2010].copy() #.copy() para no añadir la columna al doc original
pais_ultimos_10["PBI_per_capita"] = pais_ultimos_10["rgdpe"] / pais_ultimos_10["pop"]

promedio_ultimos_10 = pais_ultimos_10.groupby("country")["PBI_per_capita"].mean().reset_index()
promedio_ultimos_10 = promedio_ultimos_10.sort_values(by="PBI_per_capita", ascending=False, ignore_index=True)
print("Los 10 países con el PBI real per cápita promedio más alto (últimos 10 años) son:")
display(promedio_ultimos_10.loc[0:9,:])

Los 10 países con el PBI real per cápita promedio más alto (últimos 10 años) son:

                country  PBI_per_capita
0                 Qatar   127462.470192
1      China, Macao SAR   114428.541227
2            Luxembourg   104868.166073
3             Singapore    82549.088233
4     Brunei Darussalam    77417.468409
5               Bermuda    76420.600051
6  United Arab Emirates    69976.795304
7               Ireland    68790.810336
8                Kuwait    67011.745386
9           Switzerland    66987.607132

2. Genera el ránking de los países con el mayor incremento del PBI per cápita real PPP entre los años 1990 y 2019. ¿Dónde se ubica Perú? Para los países que no tengan información para dichos años, puede utilizar datos provenientes de hasta dos años antes o después

In [5]:
#Solución

#primero añadimos la columna PBI per capita y luego nos quedamos solo con los años de interes
pais_1990_2019 = datos_2[(datos_2["year"] == 1990)|(datos_2["year"] == 2019)].copy() #.copy() para no añadir la columna al doc original
pais_1990_2019["PBI_per_capita"] = pais_1990_2019["rgdpe"] / pais_1990_2019["pop"]

#Separamos los años de interes
cifras_1990 = pais_1990_2019[pais_1990_2019["year"]==1990][["country", "PBI_per_capita"]]
cifras_2019 = pais_1990_2019[pais_1990_2019["year"]==2019][["country", "PBI_per_capita"]]

#reunimos en base al pais
cambio_pbi = pd.merge(cifras_1990,cifras_2019,on="country")
cambio_pbi

#calculamos el incremento absoluto de PBI per capita
cambio_pbi["Variacion (1990-2019)"] = cambio_pbi["PBI_per_capita_y"] - cambio_pbi["PBI_per_capita_x"]

#finalmente, ordenamos
ranked_pbi = cambio_pbi.sort_values(by="Variacion (1990-2019)", ascending=False)
ranked_pbi = ranked_pbi.reset_index(drop=True)
display(ranked_pbi[["country", "Variacion (1990-2019)"]])

pais = "Peru"
rank_pais = ranked_pbi[ranked_pbi["country"]== pais].index[0]
print()
print(f"Dentro del ranking, {pais} ocupa el puesto {rank_pais}")

                                country  Variacion (1990-2019)
0                               Ireland           82726.713568
1                      China, Macao SAR           78788.824158
2                                 Qatar           75444.868541
3                             Singapore           67092.155508
4                            Luxembourg           66997.038564
..                                  ...                    ...
178  Venezuela (Bolivarian Republic of)           -9180.362608
179                          Montserrat          -12039.257975
180                United Arab Emirates          -54361.659880
181                             Curaçao                    NaN
182           Sint Maarten (Dutch part)                    NaN

[183 rows x 2 columns]

Dentro del ranking, Peru ocupa el puesto 81

3. Para el periodo 2010-2019, calcule el promedio del índice del capital humano. ¿Qué relación existe entre esta variable y el PBI per cápita real PPP calculado previamente? ¿y el número de horas laboradas al año por los trabajadores?

In [6]:
# Solución

# Se solicita el promedio del Indice de Capital Humano
pais_ultimos_10 = datos_2[datos_2["year"] >= 2010].copy() #.copy() para no añadir la columna al doc original
promedio_ultimos_10 = pais_ultimos_10.groupby("country")["hc"].mean().reset_index()
promedio_ultimos_10 = promedio_ultimos_10.sort_values(by="hc", ascending=False, ignore_index=True)
print("Los 10 países con el ICH más alto (últimos 10 años) son:")
display(promedio_ultimos_10.loc[0:10,:])

print("No parece haber mucha relación con el PBI real per capita, toda vez que solo dos países están en ambos top 10")

print()

pais_ultimos_10 = datos_2[datos_2["year"] >= 2010].copy() #.copy() para no añadir la columna al doc original
prom_ult_10 = pais_ultimos_10.groupby("country")["avh"].mean().reset_index()
prom_ult_10 = prom_ult_10.sort_values(by="avh", ascending=False, ignore_index=True)
prom_ult_10 = prom_ult_10.dropna(subset=["avh"])
print("Los 10 países con el menor promedio de horas trabajadas al año más bajo (últimos 10 años) son:")
display(prom_ult_10.loc[55:65,:])
print("Si bien no puede denominarse fuerte, se identifica una relación inversa entre el ICH y el número promedio de horas trabajadas (son 3 los países que figuran tanto entre los de mayor ICH como entre los de menor AVH)")

Los 10 países con el ICH más alto (últimos 10 años) son:

              country        hc
0      United Kingdom  3.738265
1            Slovakia  3.728585
2       United States  3.725502
3              Israel  3.710212
4              Canada  3.687969
5         Switzerland  3.668683
6             Germany  3.664346
7      Czech Republic  3.655292
8           Singapore  3.634774
9              Norway  3.618757
10  Republic of Korea  3.612681

No parece haber mucha relación con el PBI real per capita, toda vez que solo dos países están en ambos top 10

Los 10 países con el menor promedio de horas trabajadas al año más bajo (últimos 10 años) son:

        country          avh
55      Finland  1611.184306
56  Switzerland  1587.240678
57      Belgium  1581.577491
58      Uruguay  1559.428221
59       France  1521.865975
60   Luxembourg  1509.151489
61      Iceland  1482.977643
62  Netherlands  1426.664123
63      Denmark  1410.921266
64      Germany  1402.051018
65       Norway  1390.170680

Si bien no puede denominarse fuerte, se identifica una relación inversa entre el ICH y el número promedio de horas trabajadas (son 3 los países que figuran tanto entre los de mayor ICH como entre los de menor AVH)

4. A partir de la variable del precio de los hogares, calcula los países y los años en los cuales se registró la mayor inflación anual para todo el periodo de tiempo disponible en la base de datos

In [7]:
# Solución
#pl_c

#ordenamos pais y año
datos_2_1 = datos_2.sort_values(by=["country", "year"])

#calculamos la inflacion anual por pais y año, y ordenamos
datos_2_1["Inflación (%)"] = datos_2_1.groupby("country")["pl_c"].pct_change()*100
infl_order = datos_2_1.sort_values(by="Inflación (%)", ascending=False)
infl_order = infl_order.reset_index(drop=True)

print("Los paises y años en los que se registraron las mayores inflaciones anuales son:")
display(infl_order[["country", "year", "Inflación (%)"]].head(15))

Los paises y años en los que se registraron las mayores inflaciones anuales son:

                               country  year  Inflación (%)
0   Venezuela (Bolivarian Republic of)  2017     355.748049
1                             Zimbabwe  2005     281.705724
2                    Equatorial Guinea  2002     278.866183
3                    Brunei Darussalam  1980     265.190719
4                           Mauritania  1961     235.565319
5                           Seychelles  1994     226.327482
6                             Zimbabwe  2004     163.377645
7                         Saudi Arabia  1974     147.961250
8                               Angola  1999     144.032916
9                 United Arab Emirates  1974     140.988488
10                              Angola  1997     138.574000
11  Venezuela (Bolivarian Republic of)  2016     128.885934
12                   Brunei Darussalam  1974     122.367022
13                             Lebanon  1988     121.297922
14                              Angola  1992     115.324193

5. ¿Cuáles son los países con la mayor cantidad de missing values en la variable de productividad total de factores a precios corrientes?

In [8]:

# Solución

ctfp1 = datos_2.groupby("country")["ctfp"].apply(lambda x: x.isna().sum()) #añadimos sum() para contar el numero de NaN
ctfp2 = ctfp1.sort_values(ascending = False)

#contamos el numero de paises que tienen 70 missing values en la variable ctfp
cont_70 = (ctfp2 == 70).sum()

display(pd.DataFrame(ctfp2))
print("Hay {} países con 70 missing values en la variable ctfp".format(cont_70))

                           ctfp
country
Albania                      70
Turkmenistan                 70
Sint Maarten (Dutch part)    70
Grenada                      70
Ghana                        70
...                         ...
South Africa                  4
Spain                         4
Sri Lanka                     4
France                        4
Kenya                         4

[183 rows x 1 columns]

Hay 65 países con 70 missing values en la variable ctfp

6.  Agrupa los datos por país y calcula el promedio de las horas trabajadas anuales (avh) y de la educación promedio (hc) para el periodo 2000-2020.

In [9]:
# Solución

pais_ultimos_20 = datos_2[datos_2["year"] >= 2000].copy()
promedio_ultimos_20 = pais_ultimos_20.groupby("country")["avh"].mean().reset_index()

pais_ultimos_20 = datos_2[datos_2["year"] >= 2000].copy()
prom_ult_20 = pais_ultimos_20.groupby("country")["hc"].mean().reset_index()

merge_20 = pd.merge(promedio_ultimos_20, prom_ult_20, on="country", how="inner")
merge_20_1 = merge_20.rename(columns={"country": "País", "avh": "AVH Histórico", "hc": "Educación Histórica"})

display(merge_20_1.sort_values(by="País", ascending=True))

                                   País  AVH Histórico  Educación Histórica
0                               Albania            NaN             2.895579
1                               Algeria            NaN             2.080837
2                                Angola            NaN             1.399746
3                              Anguilla            NaN                  NaN
4                   Antigua and Barbuda            NaN                  NaN
..                                  ...            ...                  ...
178  Venezuela (Bolivarian Republic of)    1874.516018             2.538335
179                            Viet Nam    2243.230824             2.407059
180                               Yemen            NaN             1.444725
181                              Zambia            NaN             2.304970
182                            Zimbabwe            NaN             2.388763

[183 rows x 3 columns]

7.  Genere una variable que ordene a los países según el porcetaje de formación brutal de capital del 2019. Luego, estable diez grupos a manera de deciles. ¿En qué decil se ubica Péru? Vuelva a calcular usando la información de 1990. ¿El Perú se mantiene en el mismo décil o cambia?

In [10]:
# Solución
print("2019")
datos_2019 = datos_2.loc[datos_2.year == 2019]
only_csh_2019 = datos_2019[["country", "csh_i"]]
ord_csh_2019 = only_csh_2019.sort_values(by="csh_i", ascending=False)
ord_csh_2019 = ord_csh_2019.reset_index(drop=True)

#ordenamos en grupos de 10
ord_csh_2019["Decil"] = pd.qcut(ord_csh_2019["csh_i"], 10, labels=False)+1
display(ord_csh_2019)

#luego, vemos en qué decil está Perú
pais = "Peru"
decil_pais = ord_csh_2019[ord_csh_2019["country"]== pais]["Decil"].iloc[0]

print(f"{pais} se encuentra en el decil número {decil_pais}")
print()

print("1990")
datos_1990 = datos_2.loc[datos_2.year == 1990]
only_csh_1990 = datos_1990[["country", "csh_i"]]
ord_csh_1990 = only_csh_1990.sort_values(by="csh_i", ascending=False)
ord_csh_1990 = ord_csh_1990.reset_index(drop=True)

#ordenamos en grupos de 10
ord_csh_1990["Decil"] = pd.qcut(ord_csh_1990["csh_i"], 10, labels=False)+1
display(ord_csh_1990)

#luego, vemos en qué decil está Perú
pais1 = "Peru"
decil_pais1 = ord_csh_1990[ord_csh_1990["country"]== pais]["Decil"].iloc[0]

print(f"{pais1} se encuentra en el decil número {decil_pais1:.0f}. Es decir, el país ha subido un decil")

2019

                  country     csh_i  Decil
0                Djibouti  0.616744     10
1                 Ireland  0.569862     10
2                   Qatar  0.525012     10
3                Maldives  0.468125     10
4                   China  0.454168     10
..                    ...       ...    ...
178                 Sudan  0.074984      1
179  Syrian Arab Republic  0.072968      1
180     Equatorial Guinea  0.070614      1
181          Sierra Leone  0.047188      1
182         Guinea-Bissau  0.031187      1

[183 rows x 3 columns]

Peru se encuentra en el decil número 5

1990

                       country     csh_i  Decil
0                   Montserrat  0.909839   10.0
1                   Cabo Verde  0.533093   10.0
2                     Anguilla  0.515634   10.0
3                    Singapore  0.450705   10.0
4                   Seychelles  0.440294   10.0
..                         ...       ...    ...
178                      Yemen  0.033295    1.0
179               Sierra Leone  0.021410    1.0
180              Côte d'Ivoire  0.019409    1.0
181                    Curaçao       NaN    NaN
182  Sint Maarten (Dutch part)       NaN    NaN

[183 rows x 3 columns]

Peru se encuentra en el decil número 4. Es decir, el país ha subido un decil

## **Transacciones Financieras**

Importa el conjunto de datos `base_financiera.csv`

In [11]:
datos_3 = pd.read_csv("base_financiera.csv")
datos_3

      Transaction_ID Customer_ID        Date   Amount Transaction_Type Region
0               1001        C190  2023-01-01   798.68           Credit  North
1               1002        C016  2023-01-02   906.97            Debit  South
2               1003        C033  2023-01-03  1579.96            Debit  South
3               1004        C142  2023-01-04  1579.62           Credit   East
4               1005        C035  2023-01-05  3719.21            Debit  North
...              ...         ...         ...      ...              ...    ...
2025            1100        C175  2023-01-20  2137.91           Credit   East
2026            2180        C072  2023-01-20  4406.49            Debit  South
2027            1965        C022  2023-01-05   676.48            Debit  North
2028            1793        C107  2023-02-02  4099.63            Debit  North
2029            1030        C049  2023-01-30   330.36           Credit  North

[2030 rows x 6 columns]

8. Filtra todas las transacciones de tipo "Debit" en las que el monto sea mayor a 200, y calcula el monto total de esas transacciones. Además, determina cuántos clientes únicos realizaron esas transacciones.

In [12]:
# Solución

#Filtramos la información
debit_over_200 = datos_3[(datos_3["Transaction_Type"]=="Debit")&(datos_3["Amount"]>200)]
display(debit_over_200)

print()

# Calculamos el monto total de las transacciones filtradas
total_debit = debit_over_200["Amount"].sum()

# Determinamos el número de clientes únicos que hicieron las transacciones
clientes = datos_3["Customer_ID"]
clientes = clientes.drop_duplicates()
clientes_n = clientes.shape[0]

print(f"Se concluye que {clientes_n} clientes únicos realizaron transacciones del tipo y monto especificado. Estas transacciones suman un total de {total_debit}")

      Transaction_ID Customer_ID        Date   Amount Transaction_Type Region
1               1002        C016  2023-01-02   906.97            Debit  South
2               1003        C033  2023-01-03  1579.96            Debit  South
4               1005        C035  2023-01-05  3719.21            Debit  North
5               1006        C078  2023-01-06  3127.58            Debit   West
8               1009        C031  2023-01-09  4044.73            Debit   West
...              ...         ...         ...      ...              ...    ...
2016            1747        C171  2023-01-27  2498.66            Debit   West
2021            2665        C072  2023-01-25  3060.79            Debit  South
2026            2180        C072  2023-01-20  4406.49            Debit  South
2027            1965        C022  2023-01-05   676.48            Debit  North
2028            1793        C107  2023-02-02  4099.63            Debit  North

[1094 rows x 6 columns]

Se concluye que 200 clientes únicos realizaron transacciones del tipo y monto especificado. Estas transacciones suman un total de 2847871.75

9. Identifica las transacciones con valores nulos en la columna (`Amount`) . Rellena esos valores con la mediana de los montos por tipo de transacción (`Transaction_Type`) y luego calcula el monto total de transacciones por región (`region`) .

In [13]:
# Solución

#Calculamos la mediana de los montos por tipo de transacción
montos_per_type = datos_3.groupby("Transaction_Type")["Amount"].median().reset_index()
montos_per_type = montos_per_type.rename(columns={"Amount": "Monto (Mediana)"})
print("Las medianas de las transacciones por tipo de transacción son:")
display(montos_per_type)
print()

mediana_credit = montos_per_type.iloc[0,1]
mediana_debit = montos_per_type.iloc[1,1]

#identificamos las transacciones con montos nulos
trans_null = datos_3[datos_3["Amount"].isna()]

#Rellenamos con los valores especificados 
datos_4 = datos_3.copy() #añadimos copy para que los cambios no afecten a la base de datos original

datos_4.loc[(datos_4["Transaction_Type"]=="Debit")&(datos_4["Amount"].isna()), "Amount"] = mediana_debit
datos_4.loc[(datos_4["Transaction_Type"]=="Credit")&(datos_4["Amount"].isna()), "Amount"] = mediana_credit
print("La base de datos con las transacciones nulas corregidas:")
display(datos_4)
print()

#Finalmente, calculamos el monto total de transacciones por región
total_per_region = datos_4.groupby("Region")["Amount"].sum().reset_index()
total_per_region = total_per_region.rename(columns={"Amount": "Monto Total"})
print("El monto total de transacciones por región, reemplazadas las cantidades nulas, es:")
display(total_per_region)

Las medianas de las transacciones por tipo de transacción son:

  Transaction_Type  Monto (Mediana)
0           Credit          2424.42
1            Debit          2461.04

La base de datos con las transacciones nulas corregidas:

      Transaction_ID Customer_ID        Date   Amount Transaction_Type Region
0               1001        C190  2023-01-01   798.68           Credit  North
1               1002        C016  2023-01-02   906.97            Debit  South
2               1003        C033  2023-01-03  1579.96            Debit  South
3               1004        C142  2023-01-04  1579.62           Credit   East
4               1005        C035  2023-01-05  3719.21            Debit  North
...              ...         ...         ...      ...              ...    ...
2025            1100        C175  2023-01-20  2137.91           Credit   East
2026            2180        C072  2023-01-20  4406.49            Debit  South
2027            1965        C022  2023-01-05   676.48            Debit  North
2028            1793        C107  2023-02-02  4099.63            Debit  North
2029            1030        C049  2023-01-30   330.36           Credit  North

[2030 rows x 6 columns]

El monto total de transacciones por región, reemplazadas las cantidades nulas, es:

  Region  Monto Total
0   East   1269409.53
1  North   1321224.96
2  South   1208300.23
3   West   1233552.50

10. Busca transacciones duplicadas considerando las columnas (`Customer_ID`) y (`Date`). Elimina los duplicados manteniendo solo la primera ocurrencia. Luego, agrupa las transacciones restantes por (`Customer_ID`) y calcula el monto promedio y la cantidad de transacciones por cliente.

In [14]:
# Solución

#Identificamos y filtrammos

datos_3_nodp = datos_3.drop_duplicates(subset=["Customer_ID", "Date"])
datos_3_nodp

# Agrupamos por Customer_ID y calculamos el promedio
prom_per_customer = datos_3_nodp.groupby("Customer_ID")["Amount"].mean().reset_index()
prom_per_customer = prom_per_customer.rename(columns={"Amount": "Transferencia Promedio"})
print("Las transacciones promedio por cliente son:")
display(prom_per_customer)
print()

n_per_customer = datos_3_nodp.groupby("Customer_ID").size().reset_index(name="N de Transferencias")
print("El número de transacciones por cliente son:")
display(n_per_customer)

Las transacciones promedio por cliente son:

    Customer_ID  Transferencia Promedio
0          C001             3334.711875
1          C002             1881.827778
2          C003             3102.125000
3          C004             3053.882000
4          C005             3364.053333
..          ...                     ...
195        C196             2566.555000
196        C197             2530.674286
197        C198             2484.925000
198        C199             3062.287500
199        C200             2130.977500

[200 rows x 2 columns]

El número de transacciones por cliente son:

    Customer_ID  N de Transferencias
0          C001                   17
1          C002                    9
2          C003                   14
3          C004                    7
4          C005                    6
..          ...                  ...
195        C196                   10
196        C197                   14
197        C198                   12
198        C199                    5
199        C200                    5

[200 rows x 2 columns]